english_keshis = ['yanke', 'zhongyike', 'neifenmi', 'xiaohuaneike', 'huxineike', 'shenjingneike', 'shenzangneike', 'ruxianwaike', 'fuke', 'jiazhuangxianxueguanwaike', 'zhongliuke', 'erbihouke', 'shenjingwaike', 'xiaoerke', 'weichangwaike']
chinese_keshis = [
    '眼科', '中医科', '内分泌', '消化内科', '呼吸内科',
    '神经内科', '肾脏内科', '乳腺外科', '妇科', '甲状腺血管外科',
    '肿瘤科', '耳鼻喉科', '神经外科', '小儿科', '胃肠外科'
]
en_zn_keshis = { 
    'Breast Surgery': 'ruxianwaike',
    'Gastrointestinal Surgery': 'weichangwaike',
    'Thyroid Vascular Surgery': 'jiazhuangxianxueguanwaike',
    'Otorhinolaryngology': 'erbihouke',
    'Neurosurgery': 'shenjingwaike',
    'Neurology': 'shenjingneike',
    'Gastroenterology': 'xiaohuaneike',
    'Pulmonology': 'huxineike',
    'Endocrinology': 'neifenmi',
    'Nephrology': 'shenzangneike',
    'Oncology': 'zhongliuke',
    'Chinese Medicine': 'zhongyike',
    'Pediatrics': 'xiaoerke',
    'Ophthalmology': 'yanke',
    'Gynecology': 'fuke',
}

zn_en_keshis = {
    '眼科': 'yanke',
    '中医科': 'zhongyike',
    '内分泌': 'neifenmi',
    '消化内科': 'xiaohuaneike',
    '呼吸内科': 'huxineike',
    '神经内科': 'shenjingneike',
    '肾脏内科': 'shenzangneike',
    '乳腺外科': 'ruxianwaike',
    '妇科': 'fuke',
    '甲状腺血管外科': 'jiazhuangxianxueguanwaike',
    '肿瘤科': 'zhongliuke',
    '耳鼻喉科': 'erbihouke',
    '神经外科': 'shenjingwaike',
    '小儿科': 'xiaoerke',
    '胃肠外科': 'weichangwaike',
}

logic_type = {
    "患者基本信息": {
        "抽取": [
            "从新入院评估单、入院记录、入院告知书中直接抽取患者的姓名、性别、年龄、住院号、床号、病区名称、入院日期、体温、心率、呼吸、高低压等信息；",
            "根据入院相关诊断，入院记录，术前小结等文书，抽取出入院诊断；"
        ],
        "推理": [
            "根据出院医嘱，通过日期和内容进行推理出相关的信息，计算出准确的出院时间。"
        ],
        "摘要": [
            "从入院记录中对查体、简要病史进行摘要"
        ]
    },
    "出院诊断": {
        "抽取": [
            "分析患者的诊断和病程记录，抽取出院时的诊断信息，名称应为标准诊断术语，若有相关的描述信息，在括号内注明。"
        ]
    },
    "住院期间医疗情况": {
        "抽取": [
            "对患者的检查和检验信息进行综合分析，抽取并展示关键的检验和检查信息，详细的报告内容和描述不要修改。"
        ]
    },
    "病程与治疗情况": {
        "判断": [
            "从病历记录中判断治疗过程中是否进行了手术"
        ],
        "抽取": [
            "对于手术后的情况，抽取相关治疗信息，包括手术日期、麻醉方式、手术名称、术中术后病理情况、术后用药情况"
        ],
        "推理": [
            "根据病历记录，分析患者的恢复情况，如引流管状态、于何日出院，推理出院时的总体情况"
        ]
    },
    "出院时情况": {
        "摘要": [
            "从患者病历记录中摘要关键信息，以明确其出院时的总体健康情况，如精神状况、身体恢复情况等。"
        ]
    },
    "出院后用药建议": {
        "判断": [
            "根据相关病理报告，判断患者报告是否出齐"
        ],
        "抽取": [
            "根据病历记录，针对患者的出院带药、复诊与换药信息进行抽取"
        ],
        "知识": [
            "根据患者的既往史和异常检验信息，如果有慢性疾病/异常检验检查，则与知识库匹配，得到科室随访建议。"
        ]
    }
}

# 各字段来源文书名字
Each_filed_source_names = {
    '患者基本信息':{
        '住院号':['入院告知书', '入院记录'],
        '床号':['入院告知书', '入院记录'],
        '入院时间':['入院告知书','新入院评估单','乳腺中心入院记录','告未成年患者监护人书','患者授权委托书', '入院记录'],
        '出院时间':['出院医嘱', '入院记录'],
        '科室':['入院告知书','新入院评估单','乳腺中心入院记录','告未成年患者监护人书','患者授权委托书', '入院记录'],
        '姓名':['入院告知书','新入院评估单','乳腺中心入院记录','告未成年患者监护人书','患者授权委托书', '入院记录'],
        '年龄':['入院告知书','新入院评估单','乳腺中心入院记录','告未成年患者监护人书','患者授权委托书', '入院记录'],
        '性别':['入院告知书','新入院评估单','乳腺中心入院记录','告未成年患者监护人书','患者授权委托书', '入院记录'],
        '低压':['新入院评估单', '入院记录'],
        '高压':['新入院评估单', '入院记录'],
        '脉搏':['新入院评估单', '入院记录'],
        '呼吸':['新入院评估单', '入院记录'],
        '体温':['新入院评估单', '入院记录'],
        '入院诊断':['乳腺中心入院记录','首次病程记录','乳腺中心术前小结','新会诊记录','阶段小结','转入科记录', '入院记录'],
        '入院时简要病史':['乳腺中心入院记录','首次病程记录','24小时内入出院记录','入院记录'],
        '体检摘要':['乳腺中心入院记录','首次病程记录','24小时内入出院记录','主治医师首次查房记录','入院记录','乳腺中心首次病程记录','全部检查'],
    },
    '住院期间医疗情况':['全部检查','简化过滤检验'],
}


#各字段来源pattern
source_pattern = {
    "姓名": [],
    "性别": [],
    "年龄": [],
    "住院号": [],
    "床号": [],
    "科室": [],
    "入院时间": [],
    "出院时间": [],
    "低压": [],
    "高压": [],
    "脉搏": [],
    "呼吸": [],
    "体温": [],
    "入院诊断": [],
    "出院诊断": [],
    "体检摘要": [],
    "入院时简要病史": [],
    "住院期间医疗情况": [],
    "病程与治疗情况": [],
    "出院后用药建议": [],
    "出院时情况": []
}

default_source_pattern = {
    "姓名": ["王芳"],
    "性别": ["女"],
    "年龄": ["27"],
    "住院号": ["z83531"],
    "床号": ["8551"],
    "科室": ["乳腺外科一"],
    "入院时间": ["2019-01-03"],
    "出院时间": ["2019-01-04", "出院"],
    "低压": ["70"],
    "高压": ["120"],
    "脉搏": ["72 次/分"],
    "呼吸": ["16 次/分"],
    "体温": ["36.8 ℃"],
    "入院诊断": ["乳房肿物"],
    "出院诊断": ["36.8 ℃"],
    "体检摘要": ["双乳对称，右乳外下可扪及直径约2cm肿块，质地硬，边界清楚。"],
    "入院时简要病史": [
        "患者1个月前体检发现右乳肿物，乳房无压痛，无乳房局部皮肤破溃红肿，皮肤无变薄，皮下未见扩张静脉，乳头皮肤无湿疹样改变。","无乳头溢液。"
        "2019-01-04遂至我院门诊就诊，查乳腺彩超提示:右乳可见数枚肿块，其一约10点钟方向乳头旁腺体深部，大小约10.4×7.0 mm，"
        "水平位生长，呈椭圆形，边界清楚，拟US-BI-RADS 3-4A类，又一于乳头下方6点钟方向，大小约16×10 mm，拟US-BI-RADS 4A类。"
        "本次为行进一步诊治，门诊拟“右乳肿物”收治入院。自发病以来，患者神清，精神可，睡眠胃纳可，二便正常，体重无明显增减。"
    ],
    "住院期间医疗情况": [
        "###检查:\n检查ID:1102211901031224561683788\n报告时间:2019-01-03 12:30:02\n描述:心电图|常规心电图|心电图|\n图像分析:正常心电图\n",
        "###检验:\n报告时间:2019-01-03 12:03:12\n检验详情:APTT:34.6秒,正常(22.3—38.7秒);\tPT:11.8秒,正常(10.0—16.0秒);\tINR:1.00,未判断(0.0—0.0);\n"
    ],
    "病程与治疗情况": [
        "患者入院后完善相关检查，排除手术禁忌后，于2019-03-20全麻下行双乳象限切除术。",
        "术中冰冻病理提示：(左乳3点肿物）纤维腺瘤；(左乳4点肿物)纤维腺瘤；(右乳11-12点肿物）纤维腺瘤。",
        "术后石蜡病理未回。",
        "现患者一般情况良好，伤口愈合I/甲。",
        "经上级医师查房同意后，予今日出院。"
    ],
    "出院后用药建议": [
        "1. 10个工作日后来院询问石蜡病理报告，并带至主诊医师门诊就诊，拟定进一步诊疗或随访方案。",
        "2. 术后胸带加压包扎切口5天；之后可佩戴文胸；保持伤口清洁干燥，2周内避免洗澡；术后10天内每3天来院换药一次，"
        "换药门诊时间：每周一～周五9:00-11:00 在门诊大楼3楼乳腺中心。",
        "3. 保持伤口清洁干燥，如有发热，切口局部红肿、疼痛、化脓等不适，及时来院就诊。",
        "4. 心电图提示：正常范围心电图，请于心内科随访。",
        "5. 患者住院期间尿常规提示：白细胞 25.0↑/UL(参考值0~21.000/UL)，请于泌尿科随访。",
        "6. 患者术后康复评估见专页。"
    ],
    "出院时情况": ["神清，精神可，一般情况良好。", "伤口愈合I/甲。"]
}


gpt_prompt = """你是一名经验丰富的医疗分析专家。接下来我将给出一个句子组A和一些材料B，请你根据材料B中的描述，指出句子组A中的每句话分别由材料B的哪些内容支撑。请按以下格式提供答案：
每个子数组代表句子组A中的一句话。
每个子数组中的元素是材料B中的句子，这些句子直接支撑了句子组A中的对应句子。
每个句子必须在材料B中有完全一致的连续描述，禁止添加或删除内容。
如果句子组A中的某句话在材料B中没有对应的支撑内容，则在材料B中抽取一段最有可能相关的句子。
格式示例：
[
    ['材料B中的句子1', '材料B中的句子2'],  
    ['材料B中的句子3'],                 
    ['材料B中的句子4', '材料B中的句子5'], 
]
如果句子组A有N句话，最终的回应应该包含N个子数组,确保结果格式为1×N（即N个子数组，分别对应每个句子）。下面是一个示例：
句子组A：[
    "患者体温正常。",
    "无咳嗽症状。",
    "未见异常体重变化。"
]
材料B：{{
    "入院记录": "患者体温无异常，没有咳嗽症状，体重未见异常变化。",
    "24小时内记录": "患者体温正常，无咳嗽症状，体重正常，无明显变化。"
}}
输出结果：[
    ['患者体温无异常'],  
    ['没有咳嗽症状'],  
    ['体重未见异常变化', '体重正常，无明显变化']
]

句子组A: {}
材料B: {}
"""

transfer_format = {
    "低压": '低压(BP低)',
    "高压": '高压(BP高)',
    "脉搏": '脉搏(P)',
    "呼吸": '呼吸(R)',
    "体温": '体温(T)',
}

inverted_transfer_format = {v: k for k, v in transfer_format.items()}